var local_database = [
    {
        date: "Sep 18 2016",
        title: "有猫的二三天",
        imgSrc: "/images/post/t1.jpeg",
        avatar: "/images/avatar/1.png",
        content: "昨天深夜朋友短信说出国有要事，问我是否可以过两天抽空过去她家给猫铲屎？印象中她的猫美丽温顺，很好相处，就说不如拿过来寄养一星期吧。之前吃尽民宿里八只猫冷眼，现在想趁这个机会看看自己到底是不是真的一点也没有所谓的“猫缘”。",
        reading: "112",
        collection: "96",
        headImgSrc: "/images/post/t1.jpeg",
        author: "林白衣",
        dateTime: "24小时前",
        detail: "晚上发现猫在偷吃绿植，先赶快拍下难得一见的忘情姿态，然后把他驱赶到一边。他不满意地咪呜一声，跑到地板上就吐出一些叶子和固体液体的不明混合物。发短信问远在新加坡的猫主人，她说也正常，是在吐毛球，叶子对肠胃可能也会有刺激。又观察了一会儿，无恙。在淘宝上买了逗猫棒，又听猫主人说之前没有给猫买过玩具，我大喜：会不会借由逗猫棒给猫解锁一个新世界？能否有一个控制猫的有效手段，让猫在我手下变成狗一样的存在？一开始玩，猫果然为之疯狂，腾空跃起，然后重重摔在地上，兴奋地扑来跳去。我则一手挥舞着逗猫棒一手不停按下相机快门。猫和人（刚打成了“两个人”）一起忙了一阵。后来他发现了原来是我在控制着猫棒，瞬间表现出失去兴趣，扭头就走。我坐在沙发上玩起手机，他却突然一头扎过来，成功把羽毛抢到手。重复了“装作不感兴趣，等我放松警惕，狩猎成功”的几个回合后，我才意识到又被猫控制了节奏。怪不得养猫的人通常安静而谦和，是家里常有个掌握大局的主角在的缘故。",
        postId: 0,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003507bR0gDKBm.m4a?fromtag=38",
            title: "夜夜夜夜-齐秦",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001TEc6V0kjpVC.jpg?max_age=2592000"
        }
    },
    {
        title: "生活 | 夏日时光之30平出租屋大改造",
        content: "2017年5月至8月的改造，9月做成手帐。时隔一年，懒癌患者今天才po出原图，整理成日记。",
        imgSrc: "/images/post/t2.jpeg",
        reading: 62,
        detail: "从大一开始我们宿舍就没有住满过四个人而相对宽敞轻松，但是每当在超市走到家居或生鲜区只能开心又失落地逛一圈，因为一点响动而写不出字睡不着觉，湿着头发趿拉着鞋子穿过半个校园从澡堂到宿舍，我都好希望能安稳地霸占一间屋子。沙发，大床，落地镜子……最好还有一只傻猫。下定决心要在新学期前找到房子，唐sir和我提前准备完毕设，空闲时先在各种租房app上浏览，偶尔晚上散步时也会绕到学校周围的中介那里玩一下角色扮演，假装看看房了解一下行情。大概是被知乎上出租房改造的例子刺激到，又或者我俩都爱DIY，我们决定找间屋子自己设计施工（后来唐sir说如果不是我坚持这样搞事情，他自己一个人是不会这么折腾的事实证明这种房出现在中介所的几率很小。条件太差难租，中介拿到的费用也低。出发去成都之前，唐sir把学校周边的都刷遍了，只筛选了三五个符合我要求的: 离学校近、安全、价低（1.5k是极限）、足够破。然鹅，看到实景图和户型图的我总是分分钟爆炸",
        collection: 92,
        dateTime: "24小时前",
        headImgSrc: "/images/post/t2.jpeg",
        author: "迷的城",
        date: "Nov 20 2016",
        avatar: "/images/avatar/1.png",
        postId: 1,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100003GdCmG4NkEOR.m4a?fromtag=38",
            title: "鬼迷心窍-李宗盛",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000002xOmp62kqSic.jpg?max_age=2592000"
        }
    },
    {
        //按住alt + shift + F 可以格式化代码样式
        title: "当我们在谈论经济学时，我们在谈论什么?",
        content: "引言在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：...",
        detail: "1 引言\n\n在我跟学生课后交流时，以及我在知乎上阅读有关“经济”问题的论题时，经常会遇到这样的情况：有些人套用“经济理论“的知识去解释现实中发生的经济事件，结果发现很多事情讲不通，或者发现”理论告诉我们的“与现实发生的是相反的。也有学生经常跟我说：经济学有什么用？为了说明这个，我经常从两个方面来进行解释，尝试用我个人所擅长的解决问题的视角和他们能够听懂的方法来说明经济学是什么，它的作用边界在哪里：\r\n\n2 ”简笔素描“与”油画肖像“我们给人画肖像画，可以用简笔素描，也可以用油画肖像。油画肖像可以在最大程度上保存了人物的各方面的细节和特点，而简笔素描则忽略了很多细节。尽管简笔素描忽略了人物的许多细节，但我们仍旧能够很容易的认出画中的人物是谁。为什么？因为这种方法保留了人物最显著的特征，以至于我们可以忽略其次要特征而对人物做出判定。\n\n2.1 ”简笔素描“对于绝大多数的非经济学专业大众而言（经济学相关专业硕士学历以上），人们所接触到的经济学都是初级微观经济学。所谓的初级微观经济学，对于经济问题的”画法“就是一种”简笔素描“。比如初级微观经济学教材中广为使用的这种一元一次需求函数：y=bx+a，需求量的唯一变量是产品价格。但仅凭直觉我们就可以断言，现实中影响需求量的因素绝不止价格这一种，因此我们可以认为这个模型对经济问题的描述是失真的。然而但这种失真却是必要的和有意义的，其意义在与它利于揭示价格对于需求的影响，而不在于否定影响需求的其他因素——",
        imgSrc: "/images/post/sls.jpg",
        headImgSrc: "/images/post/sls.jpg",
        reading: 62,
        collection: 92,
        author: "知乎",
        date: "Nov 12 2016",
        dateTime: "三天前",
        avatar: "/images/avatar/3.png",
        postId: 2,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100004HLusI2lLjZy.m4a?fromtag=38",
            title: "女儿情-万晓利",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000004Wv5BO30pPc0.jpg?max_age=2592000"
        }
    },
    {
        title: "客厅里的京都",
        content: "从六月中旬起，我开始慢慢地写身边的物事。起因是之前写的几篇小文章得到朋友鼓励，说“你写的生活方式很有趣，不如系统地多写点生活方式的东西”。",
        imgSrc: "/images/post/t3.jpeg",
        reading: 102,
        detail: "我心底里总觉得自己不过是过着一种过度地依赖城市和网络的投机式生活，不特别，也从未创造出新鲜的东西来，又不想卖弄恋物品位，或是板起脸描绘所谓的生活哲学，于是屡屡想写又放下。直至半个月前，偶然看到松浦弥太郎前年的书《日日100》，他写的“生活哲学”我不爱看，但写物的方式倒启发了我：不如从一件一件自己真心珍爱的物什开始，轻松简短地描绘低处生活的心意。也许是我自己拥有或不拥有的身边小物，一本书，也许是常逛的花店，也许是手边放不下的零食，也许是季节小景或是一棵植物......并非购物指南，也不传达任何固定的价值观，只觉每个人本身都是世界上的一件物事，与其他的物事发生联系的同时，构筑着我们的日常生活,就以这样的想法开始，从微信公号上每天一物一件地写了下去。居然也坚持了小半个月。每天都花半个小时写一点，有一个主题就更在豆瓣上吧。第一个主题是“客厅里的京都”。",
        collection: 92,
        dateTime: "24小时前",
        headImgSrc: "/images/post/t3.jpeg",
        author: "猫是猫的猫",
        date: "Nov 20 2016",
        avatar: "/images/avatar/5.png",
        postId: 3,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100002mWVx72p8Ugp.m4a?fromtag=38",
            title: "恋恋风尘-老狼",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000001VaXQX1Z1Imq.jpg?max_age=2592000",
        }
    },
    {
        title: "我害怕世间所有的苦",
        content: "可能是年岁渐长，想起父母长辈，依恋也好责任也好，心中却常常怀有忧虑与恐惧。",
        imgSrc: "/images/post/t4.jpeg",
        reading: 102,
        detail: "这两天读到一句诗，“纵令消息未必真，杞人忧天独苦辛。” 突然想为杞人打抱一个不平，世人谓其何以忧天，世间多的是苦处，人若雪花，多的是身不由己，何以不忧。然人生顺遂如我，心忧不能与人言。从前外公重病去世的时候，妈妈爸爸作为长女长婿，种种事体，料理得井井有条，理所应当。给我一种感觉，生老病死固然使人无力，但是最后也圆圆满满体体面面。后来妈妈的生活好像也平静丰富，常常有欢乐节目，甚少提起此事。过了许久之后有一次，在电话里跟妈妈说一个事情，语气说得颇重，妈妈在电话那头竟然哭出声来，呜呜咽咽不能自已：“我今天上街想给你外公买个东西，逛着逛着突然想起来，他人没啦，我没有爸爸啦。”那一刻我想起了什么呢？我想起我小时候有一次跟爸爸走失，抬眼一看，满街的人，没有一个是我爸爸，我好像掉进了冰窟一般。如果再也见不到爸爸，我到现在想也不不敢想。可是我妈妈说，她没有爸爸啦，哭得停不下来。妈妈说以前遇到事情总是喜欢找外公说，外公总会拿拿主意，说说道理，后来尽管他病重，总归还有主心骨在，病床前也有天伦之乐，有些什么事情也不会觉得委屈。可是外公一不在，件件事情都觉得委屈。从前外公德高望重，为人称道，然而树倒猢狲散，人走茶就凉，没看见几颗真心，人人换一副嘴脸。妈妈说起这些桩桩件件的事情来，真真像一个小女孩儿。我的妈妈，她也是别人矜矜贵贵的女儿啊。她说起我的时候是怎么说的？她不说我多爱你，她说我害怕，“有了你真的知道什么叫掌上明珠，含在嘴里怕化了，捧在手里怕摔了。”你是一个BB的时候我害怕呀，怕你身体不好，怕你受委屈，怕你这不好那不好，现在你长大了我也还是害怕。如今我也害怕。也渐渐理解了为什么妈妈一个文化人那么爱算命，人生里的顺境，有太多侥幸。爱喜生忧，爱喜生怖，爱是什么感觉？就是你看着这个人就觉得自己站在平地上他在走钢丝，恨不能替他去走，是走钢丝险还是看他走钢丝险？这爱本身，就是甜蜜的苦井。为着上回我妈妈哭了这事儿，我爸专程把我说了一顿，“她心情不好，不可以跟她计较。” 这话我妈妈也常跟我说，“你爸爸心脏不好，你好好讲话，不可以对他发脾气。”",
        collection: 26,
        dateTime: "24小时前",
        headImgSrc: "/images/post/t4.jpeg",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "../../../images/avatar/5.png",
        postId: 4,
        music: {
            url: "http://ws.stream.qqmusic.qq.com/C100000Zn0vS4fKKo8.m4a?fromtag=38",
            title: "沉默是金-张国荣",
            coverImg: "http://y.gtimg.cn/music/photo_new/T002R150x150M000003at0mJ2YrR2H.jpg?max_age=2592000"
        }
    }
]

module.exports = {
    postList: local_database
}